Revit 2027 API
DesignToFabricationConverter.Convert Method
 Converts the set of MEP design elements into fabrication parts.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DesignToFabricationConverterResult Convert(
	ISet<ElementId> selection,
	int serviceId
)
Public Function Convert (
	selection As ISet(Of ElementId),
	serviceId As Integer
) As DesignToFabricationConverterResult
public:
DesignToFabricationConverterResult Convert(
	ISet<ElementId^>^ selection,
	int serviceId
)
member Convert :
        selection : ISet<ElementId> *
        serviceId : int -> DesignToFabricationConverterResult
Parameters
selection ISet<ElementId>
 The set of element identifiers to convert from MEP design elements to fabrication parts.
serviceId Int32
 The identifier of the fabrication service.
Return Value
DesignToFabricationConverterResult
Exceptions
Exception | Condition
ArgumentException |  the selection contains invalid elements to convert. -or- the specified fabrication service is not valid for all domains in the selection.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  no fabrication configuration is loaded.
Remarks
 After this method has been invoked, call:
GetConvertedFabricationParts() to get a set of element identifiers for the newly created fabrication parts.
GetElementsWithOpenConnector() to get a set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.
See Also
Reference
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace